shomanjk/esp32_balboa_spa/lib/AsyncTCP/src/AsyncTCP.cpp
// SPDX-License-Identifier: LGPL-3.0-or-later
// Copyright 2016-2025 Hristo Gochkov, Mathieu Carbou, Emil Muratov

#include "Arduino.h"

#include "AsyncTCP.h"

extern "C" {
#include "lwip/dns.h"
#include "lwip/err.h"
#include "lwip/inet.h"
#include "lwip/opt.h"
#include "lwip/tcp.h"
}

#if CONFIG_ASYNC_TCP_USE_WDT
#include "esp_task_wdt.h"
#endif

// Required for:
// https://github.com/espressif/arduino-esp32/blob/3.0.3/libraries/Network/src/NetworkInterface.cpp#L37-L47
#if ESP_IDF_VERSION_MAJOR >= 5
#include <NetworkInterface.h>
#endif

// https://github.com/espressif/arduino-esp32/issues/10526
#ifdef CONFIG_LWIP_TCPIP_CORE_LOCKING
#define TCP_MUTEX_LOCK()                                \
  if (!sys_thread_tcpip(LWIP_CORE_LOCK_QUERY_HOLDER)) { \
    LOCK_TCPIP_CORE();                                  \
  }

#define TCP_MUTEX_UNLOCK()                             \
  if (sys_thread_tcpip(LWIP_CORE_LOCK_QUERY_HOLDER)) { \
    UNLOCK_TCPIP_CORE();                               \
  }
#else  // CONFIG_LWIP_TCPIP_CORE_LOCKING
#define TCP_MUTEX_LOCK()
#define TCP_MUTEX_UNLOCK()
#endif  // CONFIG_LWIP_TCPIP_CORE_LOCKING

#define INVALID_CLOSED_SLOT -1

/*
  TCP poll interval is specified in terms of the TCP coarse timer interval, which is called twice a second
  https://github.com/espressif/esp-lwip/blob/2acf959a2bb559313cd2bf9306c24612ba3d0e19/src/core/tcp.c#L1895
*/
#define CONFIG_ASYNC_TCP_POLL_TIMER 1

/*
 * TCP/IP Event Task
 * */

typedef enum {
  LWIP_TCP_SENT,
  LWIP_TCP_RECV,
  LWIP_TCP_FIN,
  LWIP_TCP_ERROR,
  LWIP_TCP_POLL,
  LWIP_TCP_CLEAR,
  LWIP_TCP_ACCEPT,
  LWIP_TCP_CONNECTED,
  LWIP_TCP_DNS
} lwip_tcp_event_t;

typedef struct {
  lwip_tcp_event_t event;
  void *arg;
  union {
    struct {
      tcp_pcb *pcb;
      int8_t err;
    } connected;
    struct {
      int8_t err;
    } error;
    struct {
      tcp_pcb *pcb;
      uint16_t len;
    } sent;
    struct {
      tcp_pcb *pcb;
      pbuf *pb;
      int8_t err;
    } recv;
    struct {
      tcp_pcb *pcb;
      int8_t err;
    } fin;
    struct {
      tcp_pcb *pcb;
    } poll;
    struct {
      AsyncClient *client;
    } accept;
    struct {
      const char *name;
      ip_addr_t addr;
    } dns;
  };
} lwip_tcp_event_packet_t;

static QueueHandle_t _async_queue = NULL;
static TaskHandle_t _async_service_task_handle = NULL;

static SemaphoreHandle_t _slots_lock = NULL;
static const int _number_of_closed_slots = CONFIG_LWIP_MAX_ACTIVE_TCP;
static uint32_t _closed_slots[_number_of_closed_slots];
static uint32_t _closed_index = []() {
  _slots_lock = xSemaphoreCreateBinary();
  configASSERT(_slots_lock);  // Add sanity check
  xSemaphoreGive(_slots_lock);
  for (int i = 0; i < _number_of_closed_slots; ++i) {
    _closed_slots[i] = 1;
  }
  return 1;
}();

static inline bool _init_async_event_queue() {
  if (!_async_queue) {
    _async_queue = xQueueCreate(CONFIG_ASYNC_TCP_QUEUE_SIZE, sizeof(lwip_tcp_event_packet_t *));
    if (!_async_queue) {
      return false;
    }
  }
  return true;
}

// Local patch: never block forever posting events. The lwIP callbacks run in the tcpip task;
// with wait = portMAX_DELAY a full queue blocked the tcpip task while the async task (this
// queue's only consumer) was itself blocked in tcpip_api_call waiting for the tcpip task —
// a permanent AB-BA deadlock: device off the network (no ping/HTTP), no WDT, loop() running.
// Reproduced on the bench within ~15 chunked 73KB transfers with one slow client.
//
// Events fall into two classes with different loss semantics:
//  - RECV and POLL are retryable: refusing RECV makes lwIP hold the segment as refused_data
//    and redeliver it; POLL repeats on its own. These get a short bounded wait and must leave
//    CONFIG_ASYNC_TCP_QUEUE_RESERVE slots free, so a data flood can never fill the queue.
//  - SENT/FIN/ERROR/CONNECTED/DNS/ACCEPT/CLEAR are NOT redelivered by lwIP. Dropping one
//    permanently wedges accounting (_in_flight/ack credits), loses a disconnect notification,
//    or leaks a connection. These may consume the reserved slots and wait longer; with the
//    reserve in place a timeout means the consumer task has been dead for the whole wait,
//    at which point the firmware's network watchdogs are the remaining safety net.
#ifndef CONFIG_ASYNC_TCP_EVENT_WAIT_MS
#define CONFIG_ASYNC_TCP_EVENT_WAIT_MS 100
#endif
#ifndef CONFIG_ASYNC_TCP_CONTROL_EVENT_WAIT_MS
#define CONFIG_ASYNC_TCP_CONTROL_EVENT_WAIT_MS 1000
#endif
#ifndef CONFIG_ASYNC_TCP_QUEUE_RESERVE
#define CONFIG_ASYNC_TCP_QUEUE_RESERVE 32
#endif

// Free a queued event wrapper together with any payload it owns: a discarded LWIP_TCP_RECV
// still owns its pbuf chain (only _handle_async_event hands it to the client), and freeing
// just the wrapper leaked the pbufs — under queue churn that bled the lwIP pools dry.
static void _free_event(lwip_tcp_event_packet_t *e) {
  if (e->event == LWIP_TCP_RECV && e->recv.pb) {
    pbuf_free(e->recv.pb);
  }
  free((void *)e);
}

// Retryable events must not eat into the slots reserved for control events.
static inline bool _queue_has_retryable_headroom() {
  return _async_queue && uxQueueSpacesAvailable(_async_queue) > CONFIG_ASYNC_TCP_QUEUE_RESERVE;
}

static inline bool _send_async_event(lwip_tcp_event_packet_t **e, TickType_t wait = pdMS_TO_TICKS(CONFIG_ASYNC_TCP_EVENT_WAIT_MS)) {
  return _async_queue && xQueueSend(_async_queue, e, wait) == pdPASS;
}

static inline bool _send_async_control_event(lwip_tcp_event_packet_t **e) {
  return _async_queue && xQueueSend(_async_queue, e, pdMS_TO_TICKS(CONFIG_ASYNC_TCP_CONTROL_EVENT_WAIT_MS)) == pdPASS;
}

static inline bool _prepend_async_event(lwip_tcp_event_packet_t **e, TickType_t wait = pdMS_TO_TICKS(CONFIG_ASYNC_TCP_EVENT_WAIT_MS)) {
  return _async_queue && xQueueSendToFront(_async_queue, e, wait) == pdPASS;
}

static inline bool _get_async_event(lwip_tcp_event_packet_t **e) {
  while (true) {
    if (!_async_queue) {
      break;
    }

#if CONFIG_ASYNC_TCP_USE_WDT
    // need to return periodically to feed the dog
    if (xQueueReceive(_async_queue, e, pdMS_TO_TICKS(1000)) != pdPASS) {
      break;
    }
#else
    if (xQueueReceive(_async_queue, e, portMAX_DELAY) != pdPASS) {
      break;
    }
#endif

    if ((*e)->event != LWIP_TCP_POLL) {
      return true;
    }

