shomanjk/esp32_balboa_spa/lib/AsyncTCP/src/AsyncTCP.cpp
static bool customTaskCreateUniversal(
  TaskFunction_t pxTaskCode, const char *const pcName, const uint32_t usStackDepth, void *const pvParameters, UBaseType_t uxPriority,
  TaskHandle_t *const pxCreatedTask, const BaseType_t xCoreID
) {
#ifndef CONFIG_FREERTOS_UNICORE
  if (xCoreID >= 0 && xCoreID < 2) {
    return xTaskCreatePinnedToCore(pxTaskCode, pcName, usStackDepth, pvParameters, uxPriority, pxCreatedTask, xCoreID);
  } else {
#endif
    return xTaskCreate(pxTaskCode, pcName, usStackDepth, pvParameters, uxPriority, pxCreatedTask);
#ifndef CONFIG_FREERTOS_UNICORE
  }
#endif
}

static bool _start_async_task() {
  if (!_init_async_event_queue()) {
    return false;
  }
  if (!_async_service_task_handle) {
    customTaskCreateUniversal(
      _async_service_task, "async_tcp", CONFIG_ASYNC_TCP_STACK_SIZE, NULL, CONFIG_ASYNC_TCP_PRIORITY, &_async_service_task_handle, CONFIG_ASYNC_TCP_RUNNING_CORE
    );
    if (!_async_service_task_handle) {
      return false;
    }
  }
  return true;
}

/*
 * LwIP Callbacks
 * */

static int8_t _tcp_clear_events(void *arg) {
  // Local patch: close() reaches here from two different task contexts, which need different
  // handling to keep queue manipulation serialized on the consumer task:
  //  - On the async task itself (close inside an event callback): purge synchronously. We ARE
  //    the only consumer, so the rotation cannot race a dequeue; prepending a CLEAR marker
  //    here could self-deadlock on a full queue (nobody else drains it).
  //  - On any other task (loop(), user code): hand the purge to the consumer via a CLEAR
  //    marker at the queue front, so it runs before any stale event for this client. Rotating
  //    the queue from an external task would race the consumer's dequeues.
  if (xTaskGetCurrentTaskHandle() == _async_service_task_handle) {
    _remove_events_with_arg(arg);
    return ERR_OK;
  }
  lwip_tcp_event_packet_t *e = (lwip_tcp_event_packet_t *)malloc(sizeof(lwip_tcp_event_packet_t));
  if (!e) {
    log_e("Failed to allocate event packet");
    return ERR_MEM;
  }
  e->event = LWIP_TCP_CLEAR;
  e->arg = arg;
  if (!_prepend_async_event(&e, pdMS_TO_TICKS(CONFIG_ASYNC_TCP_CONTROL_EVENT_WAIT_MS))) {
    _free_event(e);
    // Consumer unresponsive for the whole wait. Last resort: racy synchronous purge beats
    // leaving events that reference a client about to be deleted.
    log_e("CLEAR marker enqueue timed out, purging from external task");
    _remove_events_with_arg(arg);
  }
  return ERR_OK;
}

static int8_t _tcp_connected(void *arg, tcp_pcb *pcb, int8_t err) {
  // ets_printf("+C: 0x%08x\n", pcb);
  lwip_tcp_event_packet_t *e = (lwip_tcp_event_packet_t *)malloc(sizeof(lwip_tcp_event_packet_t));
  if (!e) {
    log_e("Failed to allocate event packet");
    return ERR_MEM;
  }
  e->event = LWIP_TCP_CONNECTED;
  e->arg = arg;
  e->connected.pcb = pcb;
  e->connected.err = err;
  // Control event: not redelivered by lwIP, so use the reserved slots + longer wait.
  if (!_prepend_async_event(&e, pdMS_TO_TICKS(CONFIG_ASYNC_TCP_CONTROL_EVENT_WAIT_MS))) {
    free((void *)(e));
    return ERR_TIMEOUT;
  }
  return ERR_OK;
}

static int8_t _tcp_poll(void *arg, struct tcp_pcb *pcb) {
  // throttle polling events queueing when event queue is getting filled up, let it handle _onack's
  // log_d("qs:%u", uxQueueMessagesWaiting(_async_queue));
  // Local patch: also stay out of the slots reserved for control events; polls repeat anyway.
  if (!_queue_has_retryable_headroom() || uxQueueMessagesWaiting(_async_queue) > (rand() % CONFIG_ASYNC_TCP_QUEUE_SIZE / 2 + CONFIG_ASYNC_TCP_QUEUE_SIZE / 4)) {
    log_d("throttling");
    return ERR_OK;
  }

  // ets_printf("+P: 0x%08x\n", pcb);
  lwip_tcp_event_packet_t *e = (lwip_tcp_event_packet_t *)malloc(sizeof(lwip_tcp_event_packet_t));
  if (!e) {
    log_e("Failed to allocate event packet");
    return ERR_MEM;
  }
  e->event = LWIP_TCP_POLL;
  e->arg = arg;
  e->poll.pcb = pcb;
  // poll events are not critical 'cause those are repetitive, so we may not wait the queue in any case
  if (!_send_async_event(&e, 0)) {
    free((void *)(e));
    return ERR_TIMEOUT;
  }
  return ERR_OK;
}

static int8_t _tcp_recv(void *arg, struct tcp_pcb *pcb, struct pbuf *pb, int8_t err) {
  lwip_tcp_event_packet_t *e = (lwip_tcp_event_packet_t *)malloc(sizeof(lwip_tcp_event_packet_t));
  if (!e) {
    log_e("Failed to allocate event packet");
    return ERR_MEM;
  }
  e->arg = arg;
  if (pb) {
    // ets_printf("+R: 0x%08x\n", pcb);
    e->event = LWIP_TCP_RECV;
    e->recv.pcb = pcb;
    e->recv.pb = pb;
    e->recv.err = err;
    // Retryable: on refusal lwIP keeps ownership of pb (refused_data) and redelivers, so free
    // only the wrapper here — NOT via _free_event, which would free the pbuf we don't own yet.
    if (!_queue_has_retryable_headroom() || !_send_async_event(&e)) {
      free((void *)(e));
      return ERR_TIMEOUT;
    }
    return ERR_OK;
  }
  // ets_printf("+F: 0x%08x\n", pcb);
  e->event = LWIP_TCP_FIN;
  e->fin.pcb = pcb;
  e->fin.err = err;
  // close the PCB in LwIP thread
  AsyncClient::_s_lwip_fin(e->arg, e->fin.pcb, e->fin.err);
  // Control event: lwIP never redelivers a FIN, and the pcb teardown above already happened.
  // Losing it would silently orphan the connection object, so use the reserved slots + wait.
  if (!_send_async_control_event(&e)) {
    log_e("FIN event lost, connection object may leak");
    free((void *)(e));
    return ERR_TIMEOUT;
  }
  return ERR_OK;
}

static int8_t _tcp_sent(void *arg, struct tcp_pcb *pcb, uint16_t len) {
  // ets_printf("+S: 0x%08x\n", pcb);
  lwip_tcp_event_packet_t *e = (lwip_tcp_event_packet_t *)malloc(sizeof(lwip_tcp_event_packet_t));
  if (!e) {
    log_e("Failed to allocate event packet");
    return ERR_MEM;
  }
  e->event = LWIP_TCP_SENT;
  e->arg = arg;
  e->sent.pcb = pcb;
  e->sent.len = len;
  // Control event: a dropped SENT permanently strands in-flight/ack accounting upstream.
  if (!_send_async_control_event(&e)) {
    log_e("SENT event lost, ack accounting will stall");
    free((void *)(e));
    return ERR_TIMEOUT;
  }
  return ERR_OK;
}

void AsyncClient::_tcp_error(void *arg, int8_t err) {
  // ets_printf("+E: 0x%08x\n", arg);
  AsyncClient *client = reinterpret_cast<AsyncClient *>(arg);
  if (client && client->_pcb) {
    tcp_arg(client->_pcb, NULL);
    if (client->_pcb->state == LISTEN) {
      tcp_sent(client->_pcb, NULL);
      tcp_recv(client->_pcb, NULL);
      tcp_err(client->_pcb, NULL);
      tcp_poll(client->_pcb, NULL, 0);
    }
    client->_pcb = nullptr;
    client->_free_closed_slot();
  }

  // enqueue event to be processed in the async task for the user callback
  lwip_tcp_event_packet_t *e = (lwip_tcp_event_packet_t *)malloc(sizeof(lwip_tcp_event_packet_t));
  if (!e) {
    log_e("Failed to allocate event packet");
    return;
  }
  e->event = LWIP_TCP_ERROR;
  e->arg = arg;
  e->error.err = err;
  // Control event: the pcb is already detached above; losing this loses the error/disconnect
  // callback and leaks the client object.
  if (!_send_async_control_event(&e)) {
    log_e("ERROR event lost, client callbacks skipped");
    ::free((void *)(e));
  }
}

static void _tcp_dns_found(const char *name, struct ip_addr *ipaddr, void *arg) {
  lwip_tcp_event_packet_t *e = (lwip_tcp_event_packet_t *)malloc(sizeof(lwip_tcp_event_packet_t));
  if (!e) {
    log_e("Failed to allocate event packet");
    return;
  }
  // ets_printf("+DNS: name=%s ipaddr=0x%08x arg=%x\n", name, ipaddr, arg);
  e->event = LWIP_TCP_DNS;
  e->arg = arg;
  e->dns.name = name;
  if (ipaddr) {
    memcpy(&e->dns.addr, ipaddr, sizeof(struct ip_addr));
  } else {
    memset(&e->dns.addr, 0, sizeof(e->dns.addr));
  }
  // Control event: DNS results are one-shot; a drop strands the pending connect.
  if (!_send_async_control_event(&e)) {
    log_e("DNS event lost, pending connect stranded");
    free((void *)(e));
  }
}

// Used to switch out from LwIP thread
static int8_t _tcp_accept(void *arg, AsyncClient *client) {
  lwip_tcp_event_packet_t *e = (lwip_tcp_event_packet_t *)malloc(sizeof(lwip_tcp_event_packet_t));
  if (!e) {
    log_e("Failed to allocate event packet");
    return ERR_MEM;
  }
  e->event = LWIP_TCP_ACCEPT;
  e->arg = arg;
  e->accept.client = client;
  // Control event: a dropped ACCEPT leaks the freshly created client and its pcb.
  if (!_prepend_async_event(&e, pdMS_TO_TICKS(CONFIG_ASYNC_TCP_CONTROL_EVENT_WAIT_MS))) {
    log_e("ACCEPT event lost, new connection dropped");
    free((void *)(e));
    return ERR_TIMEOUT;
  }
  return ERR_OK;
}

